In [1]:
import pandas as pd

In [28]:
df = pd.read_csv('uncleaned_sales_data_500.csv')
df.head()

,order_id,date,product,category,price,quantity,total_sales,customer,region,salesperson
0,1481,2024-11-23,Microwave,Home Appliances,1276.0,wrong_quantity,1276.0,Sean,West,Mark
1,1450,2024-07-04,Washing Machine,Home Appliances,931.0,4.0,3724.0,Joseph,West,Mark
2,1476,2024-07-08,NaN,Electronics,232.0,2.0,464.0,Thomas,South,Mark
3,1435,2025-01-05,Jacket,Fashion,112.0,4.0,NaN,Noah,North,Michael
4,1369,2024-06-17,Vacuum Cleaner,Home Appliances,1106.0,5.0,5530.0,Jesse,West,Lisa

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 408 entries, 1 to 509
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   order_id     408 non-null    int64
 1   date         408 non-null    object
 2   product      408 non-null    object
 3   category     408 non-null    object
 4   price        408 non-null    float64
 5   quantity     408 non-null    float64
 6   total_sales  408 non-null    float64
 7   customer     408 non-null    object
 8   region       408 non-null    object
 9   salesperson  408 non-null    object
dtypes: float64(3), int64(1), object(6)
memory usage: 35.1+ KB

In [34]:
df.isnull().sum()

order_id       0
date           0
product        0
category       0
price          0
quantity       0
total_sales    0
customer       0
region         0
salesperson    0
dtype: int64

In [32]:
df = df.dropna()

In [36]:
df['price'] = pd.to_numeric(df['price'] , errors ='coerce')
df['quantity'] = pd.to_numeric(df['quantity'] , errors = 'coerce')

In [38]:
df['total_sales'] = df['price'] * df['quantity']

In [58]:
df.head()

,order_id,date,product,category,price,quantity,total_sales,customer,region,salesperson
1,1450,2024-07-04,Washing Machine,Home Appliances,931.0,4.0,3724.0,Joseph,West,Mark
4,1369,2024-06-17,Vacuum Cleaner,Home Appliances,1106.0,5.0,5530.0,Jesse,West,Lisa
5,1056,2024-06-29,Laptop,Electronics,717.0,1.0,717.0,Andrew,South,Michael
8,1470,2024-08-19,TV,Electronics,1416.0,2.0,2832.0,Stephen,North,Emily
9,1348,2024-04-13,Blender,Home Appliances,928.0,2.0,1856.0,Raymond,East,Emily

In [44]:
df = df.dropna(subset=["price", "quantity", "total_sales"])

In [48]:
df.size

4170

In [50]:
df = df.drop_duplicates()

In [52]:
df.size

4080

In [54]:
df['date'] = pd.to_datetime(df['date'] , errors= 'coerce')
df['date'] = df['date'].dt.strftime('%Y-%m-%d')

In [60]:
cleaned_file_path = 'cleaned_sales_data.csv'
df.to_csv(cleaned_file_path , index = False)